perf/stress_testing/ping_2.yaml
config:
  environments:
    api:
      target: 'http://localhost:5555/api'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-api"

  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  #Duración: 5 minutos
  phases:
    - name: Stable
      duration: 30
      arrivalRate: 2
    - name: Ramp up
      duration: 60
      arrivalRate: 2
      rampTo: 400
    - name: Stable
      duration: 10
      arrivalRate: 400
    - name: Stable
      duration: 40
      arrivalRate: 400
    - name: Ramp down
      duration: 5
      arrivalRate: 400
      rampTo: 300
    - name: Ramp down
      duration: 30
      arrivalRate: 300
      rampTo: 0    

scenarios:
  - name: "Ping Test"
    flow:
      - get:
          url: "/ping"
          expect:
            - statusCode: 200