perf/stress_testing/space_1.yaml
config:
  environments:
    api:
      target: 'http://localhost:5555/api'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-api"

  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  #Duración: 5 minutos
  phases:
    - name: Stable(2) 1/6
      duration: 30
      arrivalRate: 2
    - name: Ramp up(2->30) 2/6
      duration: 60
      arrivalRate: 2
      rampTo: 30
    - name: Stable(30) 3/6
      duration: 60
      arrivalRate: 30
    - name: Ramp up(30->100) 4/6
      duration: 60
      arrivalRate: 30
      rampTo: 100
    - name: Stable(100) 5/6
      duration: 60
      arrivalRate: 100
    - name: Ramp down(100-0) 6/6
      duration: 60
      arrivalRate: 100
      rampTo: 0

scenarios:
  - name: "Space News Test"
    flow:
      - get:
          url: "/spaceflight_news"
          expect:
            - statusCode: 200